"""Реализовать класс Matrix (матрица). Обеспечить перегрузку конструктора класса (метод __init__()),
который должен принимать данные (список списков) для формирования матрицы.
Подсказка: матрица — система некоторых математических величин, расположенных в виде прямоугольной схемы.
Примеры матриц вы найдете в методичке.
Следующий шаг — реализовать перегрузку метода __str__() для вывода матрицы в привычном виде.
Далее реализовать перегрузку метода __add__() для реализации операции сложения
двух объектов класса Matrix (двух матриц). Результатом сложения должна быть новая матрица.
Подсказка: сложение элементов матриц выполнять поэлементно — первый элемент первой строки первой матрицы складываем
с первым элементом первой строки второй матрицы и т.д."""


class Matrix:

    def __init__(self, matrix):
        self.matrix = matrix

    def __str__(self):
        output = str()
        for i in self.matrix:
            output += ' '.join(map(str, i)) + '\n'
        return output

    def __add__(self, other):
        result = [[self.matrix[i][j] + other.matrix[i][j] for j in range(len(self.matrix[0]))]
                  for i in range(len(self.matrix))]
        return Matrix(result)


if __name__ == '__main__':
    matrix_1 = Matrix([[1, 2], [3, 4], [5, 6]])
    matrix_2 = Matrix([[11, 12], [13, 14], [15, 16]])
    matrix_3 = Matrix([[11, 12], [13, 14], [15, 16]])
    print(matrix_1)
    print(matrix_1 + matrix_2)
    print(matrix_1 + matrix_2 + matrix_3)
